from aiogram.filters.callback_data import CallbackData
from aiogram.fsm.state import StatesGroup, State

from config import cnf


class RegState(StatesGroup):
    waiting_for_code = State()
    waiting_for_screenshot = State()
    waiting_for_phone_or_card = State()
    waiting_for_bank = State()
    waiting_for_phone_number = State()
    waiting_for_card_number = State()


class SupportState(StatesGroup):
    waiting_for_message = State()

class RegCallback(CallbackData, prefix='reg'):
    step: str


start_text = (
    "👋 Привет! Это бот компании Pure.\nВведите секретный код, указанный на голограмме"
)

code_not_found_text = (
    "❌ Код не найден. Попробуйте снова.\n"
    "Обратите внимание: цифра 0 похожа на букву О. Код вводится заглавными английскими буквами. "
    "Если возникли сложности — напишите в тех. поддержку.\nМы всегда рады помочь!"
)

code_found_text = (
    "🎉 Поздравляем!\n"
    "Вы выиграли 100 рублей!\n"
    "Для того чтобы получить выигрыш:\n\n"
    f"🔹 Подпишитесь на нашу группу о здоровье и молодости — {cnf.bot.CHANNEL_USERNAME}\n"
    "🔹 Оставьте отзыв на продукт на маркетплейсе."
)

not_subscribed_text = f"Вы не подписаны на канал {cnf.bot.CHANNEL_USERNAME}"

review_request_text = (
    "Напишите развернутый отзыв ⭐️\u00A0⭐️\u00A0⭐️\u00A0⭐️\u00A0⭐️ о продукте (качество, аромат, упаковка, результат и тд. Не менее 6 цельных слов. "
    "Отдельное спасибо за отзыв с фото нашего продукта), и пришлите скриншот"
)

screenshot_request_text = "Отправьте, пожалуйста, ваш скриншот"

screenshot_error_text = (
    "Пришлите, пожалуйста, скриншот отзыва. Если у Вас возникли сложности, напишите нам в тех. поддержку, "
    "мы будем рады Вам помочь!"
)

phone_or_card_text = "Укажите номер телефона или номер карты для зачисления выигрыша"

phone_format_text = "📱 Укажите ваш номер телефона в формате +79900000000"

card_format_text = "Укажите ваш номер карты в формате 2222 2222 2222 2222"

bank_request_text = "🏦 Укажите название банка."

success_text = (
    "🙏 Спасибо за заказ продуктов компании Pure. Ваш выигрыш уже в пути и поступит на указанные реквизиты в течение 3 рабочих дней."
)