from aiogram import Router, F
from aiogram.types import Message, CallbackQuery
from aiogram.filters import CommandStart, Command

from bot1.templates.user.keyboards import product_reaction_kb
from utils.database import get_database_bot1

router = Router()


@router.message(CommandStart())
async def cmd_start_with_product(message: Message):
    # Получаем аргументы после /start
    args = message.text.split()

    if len(args) > 1 and args[1].isdigit():
        # Если передан ID товара
        product_id = int(args[1])
        await show_product_to_user(message, product_id)
    else:
        # Обычный старт
        await show_default_start(message)


async def show_product_to_user(message: Message, product_id: int):
    try:
        db = get_database_bot1()
        products_collection = db["products"]

        # Ищем товар по ID
        product = await products_collection.find_one({"id": product_id})

        if not product:
            await message.answer("❌ Товар не найден")
            return

        # Отправляем карточку товара с кнопками
        await message.answer_photo(
            photo=product['image_id'],
            caption=f"🛍️ <b>{product['title']}</b>\n\n"
                    f"{product['desc']}\n\n",
            parse_mode="HTML",
            reply_markup=product_reaction_kb()
        )

    except Exception as e:
        await message.answer("❌ Ошибка при загрузке товара")


async def show_default_start(message: Message):
    # стандартный стартовый текст
    await message.answer(
        '''🔥Чат-бот 100% кэш-бек за отзыв.💰  

⚠️Заказ товара необходимо осуществлять только по переходу по актуальной ссылке. ❗️ При случайном переходе по неактуальной ссылке, уточните у оператора участвует ли данный товар в настоящий момент в выкупе за кэш.

⚠️Если возникли какие-то трудности или вопросы вы можете написать оператору"☑️
  
⚠️Оператор обрабатывает все запросы в течении дня, дождитесь ответа.🙌. В случае отсутствия ответа более 3-х дней продублируйте сообщение (возможно оно отправлено в неподходящем формате и оператор просто его не получил). Суббота и воскресенье выходные дни, время ответа может быть увеличено. Надеемся на ваше понимание. 🤝
Спасибо за интерес к нашему бренду.❤️'''
    )


@router.callback_query(F.data == "product_ready")
async def product_ready(call: CallbackQuery):
    await call.message.edit_caption(
        caption='''Благодарим за заказ! 👍 Будем ожидать получение заказа вместе с вами. Присылайте отзыв на согласование через 2-3 дня после получения (отзыв должен быть восторженный, содержать 2-3 предложения про эффективность препарата) с фото

Остаемся на связи! 📞 Пожалуйста, не завершайте и не удаляйте данный чат''',
        reply_markup=None
    )
    await call.answer()


# Обработка кнопки "Нет 👎"
@router.callback_query(F.data == "product_not_ready")
async def product_not_ready(call: CallbackQuery):
    # Удаляем сообщение с товаром
    await call.message.delete()

    # Показываем стандартный стартовый текст
    await call.message.answer(
        '''🔥Чат-бот 100% кэш-бек за отзыв.💰  

⚠️Заказ товара необходимо осуществлять только по переходу по актуальной ссылке. ❗️ При случайном переходе по неактуальной ссылке, уточните у оператора участвует ли данный товар в настоящий момент в выкупе за кэш.

⚠️Если возникли какие-то трудности или вопросы вы можете написать оператору"☑️
  
⚠️Оператор обрабатывает все запросы в течении дня, дождитесь ответа.🙌. В случае отсутствия ответа более 3-х дней продублируйте сообщение (возможно оно отправлено в неподходящем формате и оператор просто его не получил). Суббота и воскресенье выходные дни, время ответа может быть увеличено. Надеемся на ваше понимание. 🤝
Спасибо за интерес к нашему бренду.❤️'''
    )
    await call.answer()

